examples/openfoam_rl_env/fluid-openfoam/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// https://github.com/OpenFOAM/OpenFOAM-2.4.x/tree/master/etc/caseDicts/postProcessing/probes
probes
{
    fields ( p U T);
    probeLocations
    (
        (0.1 0.0 0.2)
        (0.3 0.0 0.2)
        (0.5 0.0 0.2)
        (0.7 0.0 0.2)
        (0.9 0.0 0.2)
    );

    #includeEtc "caseDicts/postProcessing/probes/probes.cfg"
}